Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.this["go-test:main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "go-check / All",
              + "go-test / ubuntu (go this)",
            ]
          + strict   = false
        }
    }

  # github_repository.this["go-test"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = false
      + archived                    = false
      + default_branch              = "main"
      + delete_branch_on_merge      = true
      + description                 = ":test_tube: Testing utilty library"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "go-test"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "testing",
        ]
      + visibility                  = "public"

      + security_and_analysis {

          + secret_scanning {
              + status = "enabled"
            }

          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # github_repository_collaborator.this["go-test:web3-bot"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "go-test"
      + username                    = "web3-bot"
    }

  # github_repository_file.this["go-test/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "go-test"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["ipfs-camp-2024/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "ipfs-camp-2024"
      + sha                 = (known after apply)
    }

  # github_team_repository.this["admin:go-test"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "go-test"
      + team_id    = "1516991"
    }

  # github_team_repository.this["github-mgmt stewards:go-test"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "pull"
      + repository = "go-test"
      + team_id    = "6421993"
    }

  # github_team_repository.this["ipdx:go-test"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "go-test"
      + team_id    = "6349983"
    }

  # github_team_repository.this["kubo maintainers:go-test"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "go-test"
      + team_id    = "6744049"
    }

  # github_team_repository.this["w3dt-stewards:go-test"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "go-test"
      + team_id    = "4656983"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Commentplan -->